CSI API ETABS v1

# cDesignSteelSetCode Method

---

Sets the steel design code.

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetCode(
    	string CodeName
    )

    Function SetCode (
    	CodeName As String
    ) As Integer

    Dim instance As cDesignSteel
    Dim CodeName As String
    Dim returnValue As Integer

    returnValue = instance.SetCode(CodeName)

    int SetCode(
    	String^ CodeName
    )

    abstract SetCode :
            CodeName : string -> int

#### Parameters

CodeName

    Type: SystemString
For ETABS, this is one of the following steel design code names.

  * AISC 360-10
  * AISC 360-05
  * AISC LRFD 93
  * AISC ASD 89
  * AS 4100-1998
  * BS 5950-2000
  * Chinese 2010
  * Chinese 2018
  * CSA S16-14
  * CSA S16-09
  * Eurocode 3-2005
  * IS 800:2007
  * Italian NTC 2018
  * Italian NTC 2008
  * KBC 2009
  * NZS 3404:1997
  * SP 16.13330.2017

#### Return Value

Type: Int32
Returns zero if the code is successfully set; otherwise it returns a nonzero
value.

Remarks

Examples

VB

Copy

    Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim CodeName As String

    'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")

    'start ETABS application
      ret = EtabsObject.ApplicationStart()

    'create SapModel object
       SapModel = EtabsObject.SapModel

    'initialize model
       ret = SapModel.InitializeNewModel()

    'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)

    'set steel design code
       ret = SapModel.DesignSteel.SetCode("Eurocode 3-2005")

    'close ETABS
       EtabsObject.ApplicationExit(False)

    'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing

    End Sub

See Also

#### Reference

cDesignSteel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com